src/InformationRegisters/СМСРассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СМСРассылка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/УправлениеРассылками/Ext/Module.bsl
Функция ЗарегистрироватьСообщениеКОтправке(Объект, Дата, Номер, Сообщение) Экспорт
	Если Не ЗначениеЗаполнено(Объект) Или Не ЗначениеЗаполнено(дата) Или Не ЗначениеЗаполнено(Номер) Или Не ЗначениеЗаполнено(Сообщение) Тогда 
		Сообщить("Поля: Объект отправки, Дата отправки, номер получателя и текст сообщения обязательны для заполнения");
		Отказ=Истина;
		Возврат Ложь;
	КонецЕсли;	
	Записьрег=РегистрыСведений.СМСРассылка.СоздатьНаборЗаписей();
	Записьрег.Отбор.Объект.Установить(Объект);
	Записьрег.Отбор.Дата.Установить(Дата);
	Записьрег.Отбор.Номер.Установить(Номер);
	Записьрег.Прочитать();
	Записьрег.Очистить();
	СтрокаЗаписи=Записьрег.Добавить();
	СтрокаЗаписи.Дата=Дата;
	СтрокаЗаписи.Объект=Объект;
	СтрокаЗаписи.Номер=Номер;
	СтрокаЗаписи.Сообщение=Сообщение;
	Записьрег.Записать();
	Возврат Истина;
КонецФункции
